
//1
'2020-10',1,1,1,'2020年9月软件质量分析月报',1
2020年9月软件质量分析月报
信息科技部测试共享处
2020年10月12日

//3
本月有{{plan_version_num}}次规划内版本,{{limit_version_num}}次临时版本；临时增加任务数{{临时增加任务数}}个,临时撤销任务数{{临时撤销任务数}}个；版本变更率为2.05%，软件测试风险(注1)为低；
敏捷类系统测试任务数为194个，设计用例15465个，共发现缺陷345个，总体缺陷率为2.23%，开发质量(注2)一般；
运维期(非敏捷)系统测试任务数为292个，设计用例17355个，共发现缺陷398个，总体缺陷率为2.29%，开发质量(注2)一般；
项目期(非敏捷)系统测试任务数为16个，设计用例1576个，共发现缺陷58个，总体缺陷率为3.68%，开发质量(注2)一般；

注3：为配合信息科技部PMO/质量/安全处 每月KPI统计，每月月报统计口径为上月26日至本月25日。
注4：本月起，系统统计口径更改为敏捷类系统、运维期系统（非敏捷）及项目期系统（非敏捷）三类。

//5
9月运维期系统共发布8个版本，高于去年同期水平（2019年月平均版本数为6.83）
请继续做好版本规划，控制版本变更，保证版本质量。

//6
月临时新增需求4个，临时减少需求2个，版本变更率为2.05%,总体呈下降趋势。
希望各系统继续关注版本任务控制的稳定性，保持较低的版本变更率。

版本变更率=(临时增加任务数+临时删减任务数)/测试任务总数*100%

//7
本月敏捷类系统测试任务数为194个，设计用例15465个，共发现缺陷345个，总体缺陷率为2.23%，敏捷类系统开发质量(注2)一般；

注：本月起，系统分类统计口径发生变化。根据调研结果，上述五个系统后续归入敏捷类系统进行统计分析。

//8
本月运维期(非敏捷)系统测试任务数为292个，设计用例17355个，共发现缺陷398个，总体缺陷率为2.29%，非敏捷运维期系统开发质量(注2)一般；

平台采用敏捷开发模式外，其余系统均是稳态开发模式，后续归入运维期系统（非敏捷）类进行统计分析。

//9

本月项目期(非敏捷)系统测试任务数为16个，设计用例1576个，共发现缺陷58个，总体缺陷率为3.68%，项目期系统(非敏捷）开发质量(注2)一般；

请关注项目期系统开发质量，降低缺陷率；


//10
本月系统平均缺陷修复轮次为1.05，与一至八修复轮次数据相比，基本持平并略有下降，修复质量为一般。
本月缺陷修复轮次大于1的系统：意健险理赔系统2018版（敏捷)、车险理赔系统2015版、筋斗云-开放平台、筋斗云-车险、智能费控系统2019版及移动理赔系统。
缺陷修复轮次影响测试时效，请相关系统加强缺陷修复质量管理，降低缺陷修复轮次，保证缺陷的修复质量。

//11
本月所有系统中，严重缺陷占比1.35%(共36个），较前几月有明显下降。严重缺陷中，敏捷类系统占比最大（共27个）。

请严格控制敏捷类系统的开发质量，降低严重缺陷的个数。

一般性缺陷仍是主要缺陷，占比最大（占86.95%）。


//12
9月无测试漏检，检出率为100.00%。

//14
本月5个敏捷类系统总体缺陷率为2.23%，开发质量(注2)一般；

质量好的系统请继续保持，质量差的系统请控制开发质量，降低缺陷率。

//15
本月30个运维期系统（非敏捷）总体缺陷率为2.29%，开发质量(注2)一般。

质量好的系统请继续保持，质量差的系统请控制开发质量，降低缺陷率。

//17
2020年敏捷类系统累计发现缺陷1988个， 设计测试用例83512个，平均测试缺陷率2.38%，开发质量(注2)一般。

其中，财产险理赔系统2018版及筋斗云-开放平台缺陷率较高，请关注开发质量，降低缺陷率。


//18

全年任务数超过5个的运维期系统（非敏捷）中，全年累计缺陷率最低的系统排名为：应收应付系统2013版(缺陷率0.00%）、呼叫中心服务系统2013版(缺陷率0.14%） 、车辆标的库系统2017版(缺陷率0.18%）。
全年任务数超过5个的系统中，全年累计缺陷率最高的系统排名为：风险管理信息系统2017版(缺陷率23.91%）、筋斗云－再保(6月至今）(缺陷率8.11%）、筋斗云－报表(7月至今）(缺陷率7.87%）。
质量好的系统请继续保持，质量差的系统请控制开发质量，降低缺陷率。

*注：全年任务数小于等于5个的系统，不参与按系统的全年累计排名。

//19
9月遗留缺陷清单
漏检经验总结




























